<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release of Microsoft Company Portal package, creates a new package containing only the app bundle and imports the new package into Jamf Pro server.</string>
        <key>Identifier</key>
        <string>com.github.txhaflaire.jss.CompanyPortal</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>CompanyPortal</string>
            <key>CATEGORY</key>
            <string>Software - Unlicensed</string>
            <key>OS_REQUIREMENTS</key>
            <string>10.14.x,10.13.x,10.12.x,10.11.x</string>
            <key>POLICY_CATEGORY</key>
            <string>Automatic Patch Management</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/PolicyTemplate.xml</string>
            <key>SELF_SERVICE_ICON</key>
            <string>%RECIPE_DIR%/CompanyPortal.png</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
            <key>GROUP_NAME</key>
            <string>Patch Reporting: %NAME%</string>
            <key>SELF_SERVICE_DESCRIPTION</key>
            <string>The Company Portal provides access to corporate apps and resources from almost any network. Your company must already subscribe to Microsoft Intune, and your IT admin must set up your account before you can use this app.</string>
            <key>SELF_SERVICE_ICON</key>
            <string>%NAME%.png</string>
            <key>SELFSERVICE_GROUP_TEMPLATE</key>
            <string>SelfServiceSmartGroupTemplate.xml</string>
            <key>SELFSERVICE_POLICY_TEMPLATE</key>
            <string>SelfServicePolicyTemplate.xml</string>
            <key>SELFSERVICE_POLICY_CATEGORY</key>
            <string>Software - Unlicensed</string>
            <key>ADE_POLICY_NAME</key>
            <string>21 Company Portal</string>
            <key>ADE_POLICY_TEMPLATE</key>
            <string>ADEPolicyTemplate.xml</string>
            <key>ADE_GROUP_TEMPLATE</key>
            <string>ADESmartGroupTemplate.xml</string>
            <key>ADE_POLICY_TRIGGER</key>
            <string>DEP_CompanyPortal</string>
            <key>ADE_POLICY_CATEGORY</key>
            <string>@Automated Device Enrollment</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.6.1</string>
        <key>ParentRecipe</key>
        <string>com.github.jlehikoinen.download.CompanyPortal</string>
        <key>Process</key>
        <array>
        <dict>
		    <key>Processor</key>
		    <string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
	    </dict>
            <dict>
                <key>Comment</key>
                <string>First expand flat package</string>
                <key>Processor</key>
                <string>FlatPkgUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>flat_pkg_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
                    <key>purge_destination</key>
                    <false/>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Unpack pkg based on pkg payload information</string>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_payload_path</key>
                    <string>%RECIPE_CACHE_DIR%/pkg_unpack/CompanyPortal-Component.pkg/Payload</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>purge_destination</key>
                    <false/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>AppPkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>app_path</key>
                    <string>%RECIPE_CACHE_DIR%/Applications/Company Portal.app</string>
                </dict>
            </dict>
            <dict>
                <key>Comment</key>
                <string>Delete temp directories</string>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/pkg_unpack</string>
                        <string>%RECIPE_CACHE_DIR%/Applications/Company Portal.app</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>pkg_path</key>
                    <string>%RECIPE_CACHE_DIR%/CompanyPortal-%version%.pkg</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%ADE_GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>policy_category</key>
                    <string>%ADE_POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%ADE_POLICY_TEMPLATE%</string>
                    <key>ade_policy_trigger</key>
                    <string>%ADE_POLICY_TRIGGER%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>ade_policy_name</key>
                    <string>%ADE_POLICY_NAME%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>STOP_IF_NO_JSS_UPLOAD</key>
                    <string>False</string>
                </dict>
                <key>Comment</key>
                <string>Automated Device Enrollment install policy</string>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
