<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Rectangle and then uploads to the JSS</string>
    <key>Identifier</key>
    <string>com.github.txhaflaire.jss.Rectangle</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Software - Unlicensed</string>
        <key>GROUP_NAME</key>
        <string>Patch Reporting: %NAME%</string>
        <key>GROUP_TEMPLATE</key>
        <string>SmartGroupTemplate.xml</string>
        <key>NAME</key>
        <string>Rectangle</string>
        <key>POLICY_CATEGORY</key>
        <string>Automatic Patch Management</string>
        <key>POLICY_TEMPLATE</key>
        <string>PolicyTemplate.xml</string>
        <key>SELF_SERVICE_DESCRIPTION</key>
        <string>Move and resize windows on macOS with keyboard shortcuts and snap areas</string>
        <key>SELF_SERVICE_ICON</key>
        <string>Rectangle.png</string>
		<key>SELFSERVICE_GROUP_TEMPLATE</key>
		<string>SelfServiceSmartGroupTemplate.xml</string>
		<key>SELFSERVICE_POLICY_TEMPLATE</key>
		<string>SelfServicePolicyTemplate.xml</string>
		<key>SELFSERVICE_POLICY_CATEGORY</key>
		<string>Software - Unlicensed</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.pkg.Rectangle</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>groups</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%GROUP_NAME%</string>
                        <key>smart</key>
                        <true/>
                        <key>template_path</key>
                        <string>%GROUP_TEMPLATE%</string>
                    </dict>
                </array>
                <key>policy_category</key>
                <string>%POLICY_CATEGORY%</string>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>prod_name</key>
                <string>%NAME%</string>
                <key>self_service_description</key>
                <string>%SELF_SERVICE_DESCRIPTION%</string>
                <key>self_service_icon</key>
                <string>%SELF_SERVICE_ICON%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%SELFSERVICE_GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%SELFSERVICE_POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%SELFSERVICE_POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>STOP_IF_NO_JSS_UPLOAD</key>
				<string>False</string>
			</dict>
			<key>Comment</key>
			<string>Self Service install policy</string>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
    </array>
</dict>
</plist>