<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Anaconda Python.
Different installer types are available. Use INSTALLER_TYPE
to chose between 'sh' or 'pkg'.</string>
    <key>Identifier</key>
    <string>com.github.txhaflaire.download.Anaconda</string>
    <key>Input</key>
    <dict>
        <key>INSTALLER_TYPE</key>
        <string>pkg</string>
        <key>NAME</key>
        <string>Anaconda</string>
        <key>PYTHON_MAJOR_VERSION</key>
        <string>3</string>
        <key>SEARCH_URL</key>
        <string>https://www.anaconda.com/download/#macos</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https\://repo\.(anaconda|continuum)\.(com|io)/archive/Anaconda%PYTHON_MAJOR_VERSION%-(?P&lt;version&gt;[0-9.]+)-MacOSX-x86_64\.%INSTALLER_TYPE%)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>Python (?P&lt;PYTHON_VERSION&gt;%PYTHON_MAJOR_VERSION%\.\d)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string> 
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%%PYTHON_MAJOR_VERSION%-%version%.%INSTALLER_TYPE%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>