<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Scout and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.txhaflaire.jss.Scout</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Software - Unlicensed</string>
		<key>GROUP_NAME</key>
		<string>Patch Reporting: %NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>ScoutSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>Scout</string>
		<key>POLICY_CATEGORY</key>
		<string>Automatic Patch Management</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.txhaflaire.download.scout</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
