<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Microsoft Auto Update installer and grabs the shortened version, and uploads to JSS.</string>
	<key>Identifier</key>
	<string>com.github.txhaflaire.jss.MicrosoftAutoUpdate</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Software - Licensed</string>
		<key>GROUP_NAME</key>
		<string>Patch Reporting: Microsoft AutoUpdate</string>
		<key>GROUP_TEMPLATE</key>
		<string>Microsoft AutoUpdateSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>MSAutoUpdate</string>
		<key>POLICY_CATEGORY</key>
		<string>Automatic Patch Management</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_TRIGGER</key>
		<string></string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Install the latest version of Microsoft AutoUpdate</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Microsoft AutoUpdate.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.novaksam.pkg.MicrosoftAutoUpdate</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>Microsoft AutoUpdateExtensionAttribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>policy_trigger</key>
				<string>%POLICY_TRIGGER%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
