<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent download recipe to download the latest unlicensed Microsoft Office 365 Business Pro Suite installer package and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.txhaflaire.jss.MicrosoftOffice365BusinessProSuite</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft Office 365 Business Pro Suite</string>
            <key>CATEGORY</key>
            <string>Software - Licensed</string>
            <key>POLICY_CATEGORY</key>
            <string>Software - Unlicensed</string>
            <key>POLICY_TEMPLATE</key>
            <string>%RECIPE_DIR%/SelfServicePolicyTemplate.xml</string>
            <key>ICON</key>
            <string>%RECIPE_DIR%/MicrosoftOffice365BusinessProSuite.png</string>
            <key>GROUP_TEMPLATE</key>
            <string>%RECIPE_DIR%/SelfServiceSmartGroupTemplate.xml</string>
            <key>GROUP_NAME</key>
            <string>All managed macOS devices</string>
            <key>DESCRIPTION</key>
            <string>Microsoft Office 365 is a software suite for word processing, spreadsheets, presentations, graphics and more.</string>
            <key>ADE_POLICY_NAME</key>
            <string>22 Microsoft Office 365</string>
            <key>ADE_POLICY_TEMPLATE</key>
            <string>ADEPolicyTemplate.xml</string>
            <key>ADE_GROUP_TEMPLATE</key>
            <string>ADESmartGroupTemplate.xml</string>
            <key>ADE_POLICY_TRIGGER</key>
            <string>DEP_MSOffice</string>
            <key>ADE_POLICY_CATEGORY</key>
            <string>@Automated Device Enrollment</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.txhaflaire.pkg.MicrosoftOffice365BusinessProSuite</string>
        <key>Process</key>
        <array>
        <dict>
		    <key>Processor</key>
		    <string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
	    </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>%GROUP_NAME%</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>%ADE_GROUP_TEMPLATE%</string>
                        </dict>
                    </array>
                    <key>policy_category</key>
                    <string>%ADE_POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%ADE_POLICY_TEMPLATE%</string>
                    <key>ade_policy_trigger</key>
                    <string>%ADE_POLICY_TRIGGER%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>ade_policy_name</key>
                    <string>%ADE_POLICY_NAME%</string>
                    <key>self_service_description</key>
                    <string>%SELF_SERVICE_DESCRIPTION%</string>
                    <key>self_service_icon</key>
                    <string>%SELF_SERVICE_ICON%</string>
                    <key>STOP_IF_NO_JSS_UPLOAD</key>
                    <string>False</string>
                </dict>
                <key>Comment</key>
                <string>Automated Device Enrollment install policy</string>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
